app/views/users/show.html.erb

    <h4 class='text-primary'>Gossips</h4>
    <p><% @user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 3]]