app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
            <h5 class="card-title ">Potin n°<%= gossip.id.to_s + ' - ' + gossip.title %></h5>
            <h6 class="card-subtitle mb-2 text-muted text-right">Par <%= gossip.user.first_name + ' ' + gossip.user.last_name %></h6>