app/views/gossips/show.html.erb

    <h4 class='text-primary'>Auteur</h4>
    <%= link_to @gossip.user.first_name + ' ' + @gossip.user.last_name + ' (' + @gossip.user.city.name + ')', later_path, :class => 'btn btn-sm btn-outline-info'%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]