app/controllers/gossips_controller.rb

  def index
        # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
    @gossip = Gossip.new(title: params[:title],content: params[:content],user: User.first) #() sont les données obtenues à partir du formulaire

    respond_to do |format|
      if @gossip.save # essaie de sauvegarder en base @gossip
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
    @gossip.destroy
---
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 21]]

    def set_gossip
      @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]