app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "marine.calderon@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email:params[:email]) # on cherche s'il existe un user en base avec l'email